<script setup lang="ts">
</script>

<template>
  <div class="search-page">
    <h1>搜索页面</h1>
    <div class="search-results">
      <p>搜索功能即将上线...</p>
      <p>搜索功能即将上线...</p>
      <p>搜索功能即将上线...</p>
      <p>搜索功能即将上线...</p>
      <p>搜索功能即将上线...</p>
      <p>搜索功能即将上线...</p>
      <p>搜索功能即将上线...</p>
      <p>搜索功能即将上线...</p>
      <p>搜索功能即将上线...</p>
      <p>搜索功能即将上线...</p>
      <p>搜索功能即将上线...</p>
      <p>搜索功能即将上线...</p>
      <p>搜索功能即将上线...</p>
      <p>搜索功能即将上线...</p>
      <p>搜索功能即将上线...</p>
      <p>搜索功能即将上线...</p>
      <p>搜索功能即将上线...</p>
      <p>搜索功能即将上线...</p>
      <p>搜索功能即将上线...</p>
      <p>搜索功能即将上线...</p>
      <p>搜索功能即将上线...</p>
      <p>搜索功能即将上线...</p>
      <p>搜索功能即将上线...</p>
      <p>搜索功能即将上线...</p>
      <p>搜索功能即将上线...</p>
      <p>搜索功能即将上线...</p>
      <p>搜索功能即将上线...</p>
      <p>搜索功能即将上线...</p>
      <p>搜索功能即将上线...</p>
      <p>搜索功能即将上线...</p>
      <p>搜索功能即将上线...</p>
      <p>搜索功能即将上线...</p>
      <p>搜索功能即将上线...</p>
      <p>搜索功能即将上线...</p>
      <p>搜索功能即将上线...</p>
      <p>搜11111.</p>
    </div>
  </div>
</template>

<style scoped>
.search-page {
  max-width: 1200px;
  margin: 0 auto;
}

.search-results {
  background-color: rgba(255, 255, 255, 0.7);
  /* 白色，80% 不透明度 */

  border-radius: 8px;
  padding: 40px;
  text-align: center;
  box-shadow: 0 2px 8px rgba(0, 0, 0, 0.1);
}
</style>